Catalogs/ВидыРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыРабот</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяНаРаботу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницыВидРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЕдиницДляРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательРассчетаЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расценка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементныеРасценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧеловекоЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредварительнаяНоменклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыВидРаботы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЕдиницДляРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭлементныеРасценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЭлементныеРасценки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницыВидРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЕдиницДляРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыРабот/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура РасценкиРасценкаПриИзменении(Элемент)
	ПересчитатьОкончательнуюЦену();
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДанныеРасценки(Расценка)
	
	стДанные = Новый Структура("СтатьяЗатрат,ЕдиницыВидРаботы,ЦенаРаботы", );
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементныеРасценки.ЕдиницыВидРаботы КАК ЕдиницыВидРаботы,
		|	ЭлементныеРасценки.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ЭлементныеРасценки.ЦенаРаботы КАК ЦенаРаботы
		|ИЗ
		|	Справочник.ЭлементныеРасценки КАК ЭлементныеРасценки
		|ГДЕ
		|	ЭлементныеРасценки.Ссылка = &Расценка";
	
	Запрос.УстановитьПараметр("Расценка", Расценка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стДанные,Выборка);
	КонецЦикла;
	
    Возврат стДанные;
КонецФункции // ПолучитьДанныеРасценки()


#Область Цены
	
&НаКлиенте
Процедура ВидимостьЭлементов()
	
	Элементы.ГруппаФиксированнаяЦена.Видимость 	= Объект.ПоказательРассчетаЦены > 1;
	Элементы.Расценки.Видимость					= НЕ Элементы.ГруппаФиксированнаяЦена.Видимость;
	Элементы.ПоказательЦены.Видимость 			= Объект.ПоказательРассчетаЦены > 0;
	Элементы.ПоказательЦены.Заголовок 			= ?(Объект.ПоказательРассчетаЦены = 1, "Процент","Сумма");
	
	ПересчитатьОкончательнуюЦену();
	
КонецПроцедуры // ВидимостьЭлементов()

&НаКлиенте
Процедура ПересчитатьОкончательнуюЦену()
	
	Если Объект.ПоказательРассчетаЦены = 0 Тогда //Расчет
		мРасценки = Новый Массив;
		
		Для каждого х Из Объект.Расценки Цикл
			мРасценки.Добавить(х.Расценка);
		КонецЦикла;
		
		ЭтаФорма.ОкончательнаяЦена = ПолучитьТекстовоеПредставлениеЦены(мРасценки);	
		
	ИначеЕсли Объект.ПоказательРассчетаЦены = 1 Тогда //Процен
		мРасценки = Новый Массив;
		
		Для каждого х Из Объект.Расценки Цикл
			мРасценки.Добавить(х.Расценка);
		КонецЦикла;
		
		ЭтаФорма.ОкончательнаяЦена = ПолучитьТекстовоеПредставлениеЦены(мРасценки, Объект.ПоказательЦены);	
	Иначе
		
		ЭтаФорма.ОкончательнаяЦена = ПолучитьТекстовоеПредставлениеФиксированнойЦены(Объект.ЕдиницыВидРаботы) + Объект.ПоказательЦены + " руб.";	
	КонецЕсли;	
	
КонецПроцедуры // ПересчитатьИтог()

&НаСервереБезКонтекста
Функция ПолучитьТекстовоеПредставлениеЦены(мРасценки, Процент = 0)

	Возврат Справочники.ВидыРабот.ПолучитьТекстовоеПредставлениеЦены(Справочники.ВидыРабот.ПолучитьЦенуВидаРабот(мРасценки,,Процент));	

КонецФункции // ПолучитьТекстовоеПредставлениеЦены()

&НаСервереБезКонтекста
Функция ПолучитьТекстовоеПредставлениеФиксированнойЦены(ЕдиницыВидРаботы)

	Возврат Справочники.ВидыРабот.ПолучитьПредставлениеВидаЕдиницы(ЕдиницыВидРаботы);	

КонецФункции // ПолучитьТекстовоеПредставлениеЦены()


#КонецОбласти  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьЭлементов();
	ПересчитатьОкончательнуюЦену();
КонецПроцедуры

&НаКлиенте
Процедура ПоказательРассчетаЦеныПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПоказательЦеныПриИзменении(Элемент)
	ПересчитатьОкончательнуюЦену();
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницыВидРаботыПриИзменении(Элемент)
	ПересчитатьОкончательнуюЦену();
КонецПроцедуры
